# Network_NoOutputNode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..Network_NoOutputNode Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The calculation could not be executed as configured. Select an output node before analyzing this network.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId Network_NoOutputNode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Network_NoOutputNode As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ Network_NoOutputNode {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace